# frozen_string_literal: true

cask_args appdir: '/Applications'

brew 'asdf'
brew 'bat'
brew 'dokku/repo/dokku'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git-lfs'
brew 'git'
brew 'imagemagick'
brew 'iperf'
brew 'iperf3'
brew 'jq'
brew 'mosh'
brew 'pigz'
brew 'ripgrep'
brew 'shellcheck'
brew 'tmux'
brew 'wakeonlan'
brew 'xz'
brew 'yt-dlp/taps/yt-dlp'
brew 'z'
brew 'zsh-syntax-highlighting'
brew 'zsh'

# Mac only formulae
if OS.mac?
  brew 'macvim'
  brew 'mas'
  brew 'switchaudio-osx'
  brew 'robotsandpencils/made/xcodes'
else
  brew 'vim'
end

# Apps
cask 'a-better-finder-attributes'
cask 'a-better-finder-rename'
cask '1password'
cask '1password/tap/1password-cli'
cask 'acorn'
cask 'alacritty'
cask 'alfred'
cask 'anylist'
cask 'arq'
cask 'audacity'
cask 'big-mean-folder-machine'
cask 'bbedit'
cask 'bunch'
cask 'cardhop'
cask 'chiaki'
cask 'devonthink'
cask 'discord'
cask 'dropbox'
cask 'elgato-stream-deck'
cask 'encryptme'
cask 'rajiv/fastmate/fastmate'
cask 'fantastical'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'graphiql'
cask 'handbrake'
cask 'hammerspoon'
cask 'iina'
cask 'inkscape'
cask 'iterm2'
cask 'kitty'
cask 'keyboard-maestro'
cask 'keyboardcleantool'
cask 'microsoft-edge'
cask 'microsoft-office'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'monitorcontrol'
cask 'moom'
cask 'moonlight'
cask 'nova'
cask 'obsidian'
cask 'obs'
cask 'plex'
cask 'omnifocus'
cask 'omnioutliner'
cask 'qmk-toolbox'
cask 'retrobatch'
cask 'rocket'
cask 'setapp'
cask 'script-debugger'
cask 'slack'
cask 'sony-ps-remote-play'
cask 'spotify'
cask 'steam'
cask 'synergy'
cask 'transmit'
cask 'tunnelblick'
cask 'ui-browser'
cask 'utm'
cask 'via'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'
cask 'xcodes'
cask 'yubico-yubikey-manager'
cask 'zsa-wally'
cask 'zoom'

# Quick Look Plugins
cask 'apparency'
cask 'qlmarkdown'
cask 'qlvideo'
cask 'suspicious-package'
cask 'syntax-highlight'

# cask "kensington-works" # trackball works doesn't seem to exist, might need to be updated?
cask "logitech-options"

mas "Deliveries", id: 924726344
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Speedtest by Ookla", id: 1153157709
mas "Bear", id: 1091189122
mas "Yoink - Improved Drag and Drop", id: 457622435
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Things 3", id: 904280696
mas "Drafts", id: 1435957248
mas "Fantastical 3", id: 975937182

mas "1Blocker", id: 1365531024
mas "SmileAllDay", id: 1180442868
mas "PIPifier", id: 1160374471
# Maker Utilities
brew 'dfu-programmer'
brew 'dfu-util'
brew 'dosfstools'
brew 'hfsutils'
brew 'stlink'
brew 'teensy_loader_cli'
brew 'gromgit/fuse/ext4fuse-mac'
brew 'openscad/tap/lib3mf'
brew 'osx-cross/arm/arm-gcc-bin@8'
brew 'osx-cross/avr/avr-binutils'
brew 'osx-cross/var/avr-gcc@8'
brew 'qmk/qmk/mdloader'
brew 'qmk/qmk/qmk'
cask 'homebrew/cask-drivers/3dconnexion'
cask 'android-platform-tools'
cask 'arduino'
cask 'autodesk-fusion360'
cask 'balenaetcher'
cask 'freecad'
cask 'kicad'
cask 'macfuse'
cask 'meshlab'
cask 'mu-editor'
cask 'openscad'
cask 'prusaslicer'
cask 'raspberry-pi-imager'
cask 'sdformatter'
cask 'ultimaker-cura'

# Home Mac
brew 'rom-tools'
cask 'adobe-creative-cloud'
cask 'discord'
cask 'multipatch'
cask 'oscar'
cask 'parallels'

# Work Mac
cask 'docker'
# drivers that might not be needed but I wanted to save the name for
# cask "silicon-labs-vcp-driver"
