# frozen_string_literal: true

cask_args appdir: '/Applications'

brew 'bat'
brew 'dokku/repo/dokku'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git-lfs'
brew 'git'
brew 'imagemagick'
brew 'iperf'
brew 'iperf3'
brew 'jq'
brew 'mosh'
brew 'pigz'
brew 'ripgrep'
brew 'shellcheck'
brew 'tmux'
brew 'wakeonlan'
brew 'xz'
brew 'yt-dlp/taps/yt-dlp'
brew 'z'
brew 'zsh-syntax-highlighting'
brew 'zsh'

# Mac only formulae
if OS.mac?
  brew 'macvim'
  brew 'mas'
  brew 'switchaudio-osx'
  brew 'robotsandpencils/made/xcodes'
else
  brew 'vim'
end

# Apps
cask 'a-better-finder-attributes'
cask 'a-better-finder-rename'
cask '1password'
cask '1password/tap/1password-cli'
cask 'acorn'
cask 'alacritty'
cask 'alfred'
cask 'anylist'
cask 'arq'
cask 'audacity'
cask 'big-mean-folder-machine'
cask 'bbedit'
cask 'bunch'
cask 'cardhop'
cask 'chiaki'
cask 'devonthink'
cask 'discord'
cask 'dropbox'
cask 'elgato-stream-deck'
cask 'encryptme'
cask 'rajiv/fastmate/fastmate'
cask 'fantastical'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'graphiql'
cask 'handbrake'
cask 'hammerspoon'
cask 'iina'
cask 'inkscape'
cask 'iterm2'
cask 'kitty'
cask 'keyboard-maestro'
cask 'keyboardcleantool'
cask 'microsoft-edge'
cask 'microsoft-office'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'monitorcontrol'
cask 'moom'
cask 'moonlight'
cask 'nova'
cask 'obsidian'
cask 'obs'
cask 'plex'
cask 'omnifocus'
cask 'omnioutliner'
cask 'qmk-toolbox'
cask 'retrobatch'
cask 'rocket'
cask 'setapp'
cask 'script-debugger'
cask 'slack'
cask 'sony-ps-remote-play'
cask 'spotify'
cask 'steam'
cask 'synergy'
cask 'transmit'
cask 'tunnelblick'
cask 'ui-browser'
cask 'utm'
cask 'via'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'
cask 'xcodes'
cask 'yubico-yubikey-manager'
cask 'zsa-wally'
cask 'zoom'

# Quick Look Plugins
cask 'apparency'
cask 'qlmarkdown'
cask 'qlvideo'
cask 'suspicious-package'
cask 'syntax-highlight'

# Maker Utilities
brew 'dfu-programmer'
brew 'dfu-util'
brew 'dosfstools'
brew 'hfsutils'
brew 'stlink'
brew 'teensy_loader_cli'
brew 'gromgit/fuse/ext4fuse-mac'
brew 'openscad/tap/lib3mf'
brew 'osx-cross/arm/arm-gcc-bin@8'
brew 'osx-cross/avr/avr-binutils'
brew 'osx-cross/var/avr-gcc@8'
brew 'qmk/qmk/mdloader'
brew 'qmk/qmk/qmk'
cask 'homebrew/cask-drivers/3dconnexion'
cask 'android-platform-tools'
cask 'arduino'
cask 'autodesk-fusion360'
cask 'balenaetcher'
cask 'freecad'
cask 'kicad'
cask 'macfuse'
cask 'meshlab'
cask 'mu-editor'
cask 'openscad'
cask 'prusaslicer'
cask 'raspberry-pi-imager'
cask 'sdformatter'
cask 'ultimaker-cura'

# Home Mac
brew 'rom-tools'
cask 'adobe-creative-cloud'
cask 'discord'
cask 'multipatch'
cask 'oscar'
cask 'parallels'

# Work Mac
cask 'docker'

# Wine-ing around
cask 'gcenx/wine/unofficial-wineskin'

# SetApp Apps
# cask "airbuddy"
# cask "bartender"
# cask "base"
# cask "betterzip"
# cask "dash"
# cask "devutils"
# cask "due"
# cask "istat-menus"
# cask "marked"
# cask "rapidapi" # aka Paw
# cask "screens"
# cask "soulver"
# cask "yoink"

# Rogue Amoeba
cask 'audio-hijack'
cask 'loopback'
cask 'soundsource'
cask 'fission'
cask 'farrago'

tap 'homebrew/cask-drivers'
# driver situation is odd for now, not sure which drivers are up-to-date for Apple Silicon
# cask "kensington-works" # trackball works doesn't seem to exist, might need to be updated?
# cask "logitech-options"
# cask "kensingtonworks"
# cask "8bitdo-ultimate-software"
# cask "betterdisplay"
# cask "imazing"
# drivers that might not be needed but I wanted to save the name for
# cask "silicon-labs-vcp-driver"

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-blex-mono-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-sf-compact'
cask 'font-sf-mono'
cask 'epk/epk/font-sf-mono-nerd-font'
cask 'font-sf-pro'

# Mac App Store
mas 'Actions', id: 1586435171
mas 'Affinity Designer 2', id: 1616831348
mas 'Affinity Photo 2', id: 1616822987
mas 'Affinity Publisher 2', id: 1606941598
mas 'Balance Lock', id: 1019371109
mas 'Broadcasts', id: 1469995354
mas 'Brother P-touch Editor', id: 1453365242
mas 'DaisyDisk', id: 411643860
mas 'Day One', id: 1055511498
mas 'Deliveries', id: 924726344
mas 'Disk Speed Test', id: 1289583905
mas 'Drafts', id: 1435957248
mas 'Front and Center', id: 1493996622
mas 'Home Assistant', id: 1099568401
mas 'Paprika Recipe Manager 3', id: 1303222628
mas 'Parcel', id: 639968404
mas 'Pixelmator Pro', id: 1289583905
mas 'Speedtest by Ookla', id: 1153157709
mas 'SwitchGlass', id: 1498546559
mas 'Tailscale', id: 1475387142
mas 'TestFlight', id: 899247664
mas 'Things 3', id: 904280696
mas 'Vinegar', id: 1591303229
mas 'xScope', id: 889428659

mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541

mas '1Blocker', id: 1365531024
mas 'PiPifier', id: 1160374471
mas 'Noir', id: 1592917505
mas 'Tampermonkey', id: 1482490089
mas 'Tabs to Links', id: 1019371109
mas '1Password for Safari', id: 1569813296
mas 'Shazam', id: 897118787
mas 'StopTheMadness', id: 1376402589
mas 'Hush', id: 1544743900
